{  "author": ["ElastiFlow Inc."],  "license": "ElastiFlow EULA",  "immutable": false,  "max_signals": 100,  "throttle": "no_actions",  "enabled": false,  "rule_id": "d9b02868-38e0-4031-8a89-7c1ac5bbd953",  "name": "TCP X-Mas Flags",  "tags": ["elastiflow", "security", "ddos", "evasion"],  "description": "A TCP X-Max Flags attack sends TCP packets with all flag bits set. Such packets are considered illegal by the TCP RFCs. Varying systems may react differently to these packets and may cause unexpected issues and behavior. In some case stateful defenses may go down, including possibly going into a fail-open mode. Such packets are also used as a smoke screen for more advanced attacks.",  "type": "query",  "language": "kuery",  "index": ["elastiflow-flow-codex-**"],  "query": "*",  "filters": [{    "meta": {      "type": "phrases",      "key": "tcp.flags.bits",      "params": ["255", "127", "63"],      "alias": null,      "negate": false,      "disabled": false    },    "query": {      "bool": {        "should": [{          "match_phrase": {            "tcp.flags.bits": "255"          }        }, {          "match_phrase": {            "tcp.flags.bits": "127"          }        }, {          "match_phrase": {            "tcp.flags.bits": "63"          }        }],        "minimum_should_match": 1      }    },    "$state": {      "store": "globalState"    }  }],  "interval": "5m",  "from": "now-360s",  "to": "now",  "meta": {    "from": "1m"  },  "risk_score": 47,  "severity": "medium",  "threat": [{    "framework": "MITRE ATT&CK",    "tactic": {      "id": "TA0005",      "reference": "https://attack.mitre.org/tactics/TA0005",      "name": "Defense Evasion"    },    "technique": [{      "id": "T1599",      "reference": "https://attack.mitre.org/techniques/T1599",      "name": "Network Boundary Bridging",      "subtechnique": []    }]  }],  "references": ["https://attack.mitre.org/techniques/T1599/"]}
{  "author": ["ElastiFlow Inc."],  "license": "ElastiFlow EULA",  "immutable": false,  "max_signals": 100,  "throttle": "no_actions",  "enabled": false,  "rule_id": "831ce4d7-5df0-4318-9a8b-2aff8852bdab",  "name": "TCP URG Flag",  "tags": ["elastiflow", "security", "ddos"],  "description": "A TCP URG Flag attack sends TCP packets with the Urgent (URG) flag set. Use of the TCP Urgent flag is very uncommon in modern systems and is thus considered suspicious when it is observed.",  "type": "query",  "language": "kuery",  "index": ["elastiflow-flow-codex-**"],  "query": "*",  "filters": [{    "meta": {      "type": "custom",      "disabled": false,      "negate": false,      "alias": "TCP URG Flag",      "key": "query",      "value": "{\"bool\":{\"must\":[{\"term\":{\"tcp.flags.tags\":\"URG\"}}],\"must_not\":[{\"terms\":{\"tcp.flags.bits\":[63,127,255]}}]}}"    },    "query": {      "bool": {        "must": [{          "term": {            "tcp.flags.tags": "URG"          }        }],        "must_not": [{          "terms": {            "tcp.flags.bits": [63, 127, 255]          }        }]      }    },    "$state": {      "store": "globalState"    }  }],  "interval": "5m",  "from": "now-360s",  "to": "now",  "meta": {    "from": "1m"  },  "risk_score": 21,  "severity": "low",  "threat": [{    "framework": "MITRE ATT&CK",    "technique": [{      "reference": "https://attack.mitre.org/techniques/T1498",      "name": "Network Denial of Service",      "subtechnique": [{        "reference": "https://attack.mitre.org/techniques/T1498/001",        "name": "Direct Network Flood",        "id": "T1498.001"      }],      "id": "T1498"    }],    "tactic": {      "reference": "https://attack.mitre.org/tactics/TA0040",      "name": "Impact",      "id": "TA0040"    }  }],  "references": ["https://attack.mitre.org/techniques/T1498/001/"]}
{  "author": ["ElastiFlow Inc."],  "license": "ElastiFlow EULA",  "immutable": false,  "max_signals": 100,  "throttle": "no_actions",  "enabled": false,  "rule_id": "86e29e4b-49af-40b1-aa6d-7975fb172eb3",  "name": "TCP null Flags",  "tags": ["elastiflow", "security", "reconnaissance"],  "description": "A TCP null Flags scan is used to determine if ports are closed on a target IP address. This is accomplished by sending TCP packets with no flag bits set. Such packets are illegal based on the TCP RFC, which specifies that any TCP packet with an out-of-state flag sent to an open port is discarded. However packets with out-of-state flags sent to closed ports are sent a RST response. This allows an attacker to scan for closed ports via the resulting RST packets. In addition to being fast, the major advantage of this scan type is its ability to scan through stateless firewall or ACL filters.",  "type": "query",  "language": "kuery",  "index": ["elastiflow-flow-codex-**"],  "query": "*",  "filters": [{    "meta": {      "type": "custom",      "disabled": false,      "negate": false,      "alias": "TCP null Flags",      "key": "query",      "value": "{\"bool\":{\"must\":[{\"term\":{\"l4.proto.name\":\"TCP\"}},{\"term\":{\"tcp.flags.bits\":0}}]}}"    },    "query": {      "bool": {        "must": [{          "term": {            "l4.proto.name": "TCP"          }        }, {          "term": {            "tcp.flags.bits": 0          }        }]      }    },    "$state": {      "store": "globalState"    }  }],  "interval": "5m",  "from": "now-360s",  "to": "now",  "meta": {    "from": "1m"  },  "risk_score": 21,  "severity": "low",  "threat": [{    "framework": "MITRE ATT&CK",    "technique": [{      "reference": "https://attack.mitre.org/techniques/T1046",      "name": "Network Service Scanning",      "subtechnique": [],      "id": "T1046"    }],    "tactic": {      "reference": "https://attack.mitre.org/tactics/TA0007",      "name": "Discovery",      "id": "TA0007"    }  }],  "references": ["https://attack.mitre.org/techniques/T1046/"]}
{  "exported_count": 3,  "missing_rules": [],  "missing_rules_count": 0}