{  "author": ["ElastiFlow Inc."],  "license": "ElastiFlow EULA",  "immutable": false,  "max_signals": 100,  "throttle": "no_actions",  "enabled": false,  "rule_id": "d9b02868-38e0-4031-8a89-7c1ac5bbd953",  "name": "TCP X-Mas Flags",  "tags": ["elastiflow", "security", "ddos", "evasion"],  "description": "A TCP X-Max Flags attack sends TCP packets with all flag bits set. Such packets are considered illegal by the TCP RFCs. Varying systems may react differently to these packets and may cause unexpected issues and behavior. In some case stateful defenses may go down, including possibly going into a fail-open mode. Such packets are also used as a smoke screen for more advanced attacks.",  "type": "query",  "language": "kuery",  "index": ["elastiflow-flow-ecs-*"],  "query": "*",  "filters": [{    "meta": {      "type": "phrases",      "key": "tcp.flags.bits",      "params": ["255", "127", "63"],      "alias": null,      "negate": false,      "disabled": false    },    "query": {      "bool": {        "should": [{          "match_phrase": {            "tcp.flags.bits": "255"          }        }, {          "match_phrase": {            "tcp.flags.bits": "127"          }        }, {          "match_phrase": {            "tcp.flags.bits": "63"          }        }],        "minimum_should_match": 1      }    },    "$state": {      "store": "globalState"    }  }],  "interval": "5m",  "from": "now-360s",  "to": "now",  "meta": {    "from": "1m"  },  "risk_score": 47,  "severity": "medium",  "threat": [{    "framework": "MITRE ATT&CK",    "tactic": {      "id": "TA0005",      "reference": "https://attack.mitre.org/tactics/TA0005",      "name": "Defense Evasion"    },    "technique": [{      "id": "T1599",      "reference": "https://attack.mitre.org/techniques/T1599",      "name": "Network Boundary Bridging",      "subtechnique": []    }]  }],  "references": ["https://attack.mitre.org/techniques/T1599/"]}
{  "author": ["ElastiFlow Inc."],  "license": "ElastiFlow EULA",  "immutable": false,  "max_signals": 100,  "throttle": "no_actions",  "enabled": false,  "rule_id": "831ce4d7-5df0-4318-9a8b-2aff8852bdab",  "name": "TCP URG Flag",  "tags": ["elastiflow", "security", "ddos"],  "description": "A TCP URG Flag attack sends TCP packets with the Urgent (URG) flag set. Use of the TCP Urgent flag is very uncommon in modern systems and is thus considered suspicious when it is observed.",  "type": "query",  "language": "kuery",  "index": ["elastiflow-flow-ecs-*"],  "query": "*",  "filters": [{    "meta": {      "type": "custom",      "disabled": false,      "negate": false,      "alias": "TCP URG Flag",      "key": "query",      "value": "{\"bool\":{\"must\":[{\"term\":{\"tcp.flags.tags\":\"URG\"}}],\"must_not\":[{\"terms\":{\"tcp.flags.bits\":[63,127,255]}}]}}"    },    "query": {      "bool": {        "must": [{          "term": {            "tcp.flags.tags": "URG"          }        }],        "must_not": [{          "terms": {            "tcp.flags.bits": [63, 127, 255]          }        }]      }    },    "$state": {      "store": "globalState"    }  }],  "interval": "5m",  "from": "now-360s",  "to": "now",  "meta": {    "from": "1m"  },  "risk_score": 21,  "severity": "low",  "threat": [{    "framework": "MITRE ATT&CK",    "technique": [{      "reference": "https://attack.mitre.org/techniques/T1498",      "name": "Network Denial of Service",      "subtechnique": [{        "reference": "https://attack.mitre.org/techniques/T1498/001",        "name": "Direct Network Flood",        "id": "T1498.001"      }],      "id": "T1498"    }],    "tactic": {      "reference": "https://attack.mitre.org/tactics/TA0040",      "name": "Impact",      "id": "TA0040"    }  }],  "references": ["https://attack.mitre.org/techniques/T1498/001/"]}
{  "author": ["ElastiFlow Inc."],  "license": "ElastiFlow EULA",  "immutable": false,  "max_signals": 100,  "throttle": "no_actions",  "enabled": false,  "rule_id": "86e29e4b-49af-40b1-aa6d-7975fb172eb3",  "name": "TCP null Flags",  "tags": ["elastiflow", "security", "reconnaissance"],  "description": "A TCP null Flags scan is used to determine if ports are closed on a target IP address. This is accomplished by sending TCP packets with no flag bits set. Such packets are illegal based on the TCP RFC, which specifies that any TCP packet with an out-of-state flag sent to an open port is discarded. However packets with out-of-state flags sent to closed ports are sent a RST response. This allows an attacker to scan for closed ports via the resulting RST packets. In addition to being fast, the major advantage of this scan type is its ability to scan through stateless firewall or ACL filters.",  "type": "query",  "language": "kuery",  "index": ["elastiflow-flow-ecs-*"],  "query": "*",  "filters": [{    "meta": {      "type": "custom",      "disabled": false,      "negate": false,      "alias": "TCP null Flags",      "key": "query",      "value": "{\"bool\":{\"must\":[{\"term\":{\"network.transport\":\"TCP\"}},{\"term\":{\"tcp.flags.bits\":0}}]}}"    },    "query": {      "bool": {        "must": [{          "term": {            "network.transport": "TCP"          }        }, {          "term": {            "tcp.flags.bits": 0          }        }]      }    },    "$state": {      "store": "globalState"    }  }],  "interval": "5m",  "from": "now-360s",  "to": "now",  "meta": {    "from": "1m"  },  "risk_score": 21,  "severity": "low",  "threat": [{    "framework": "MITRE ATT&CK",    "technique": [{      "reference": "https://attack.mitre.org/techniques/T1046",      "name": "Network Service Scanning",      "subtechnique": [],      "id": "T1046"    }],    "tactic": {      "reference": "https://attack.mitre.org/tactics/TA0007",      "name": "Discovery",      "id": "TA0007"    }  }],  "references": ["https://attack.mitre.org/techniques/T1046/"]}
{  "author": ["ElastiFlow Inc."],  "license": "ElastiFlow EULA",  "immutable": false,  "max_signals": 100,  "throttle": "no_actions",  "enabled": false,  "rule_id": "84241928-e067-4bdf-9e02-2c6b2395efd4",  "name": "SMB Access from Public IP",  "tags": ["elastiflow", "security", "access", "inbound"],  "description": "A connection attempt is made to the Server Message Block (SMB) shares from a public IP address. SMB is a network protocol commonly used for file sharing and printer access in Windows environments. Access to SMB shares from public IP addresses can indicate external attackers trying to exploit vulnerabilities or unauthorized users attempting to gain unauthorized access to sensitive data and files.",  "note": "When this alert is triggered, immediate action should be taken by the IT or security team to investigate the source of the access attempt and assess whether it is legitimate or malicious. Response actions may include blocking the offending IP address, updating firewall rules, reviewing access controls, and strengthening security measures to prevent future unauthorized access.",  "type": "query",  "language": "kuery",  "index": ["elastiflow-flow-ecs-*"],  "query": "*",  "filters": [{    "$state": {      "store": "globalState"    },    "meta": {      "negate": false,      "index": "elastiflow-flow-ecs-*",      "alias": "Public SMB Access",      "disabled": false,      "type": "combined",      "params": [{        "meta": {          "field": "server.port",          "negate": false,          "index": "elastiflow-flow-ecs-*",          "alias": null,          "disabled": false,          "params": ["137", "138", "139", "445"],          "type": "phrases",          "value": ["137", "138", "139", "445"],          "key": "server.port"        },        "query": {          "bool": {            "should": [{              "match_phrase": {                "server.port": "137"              }            }, {              "match_phrase": {                "server.port": "138"              }            }, {              "match_phrase": {                "server.port": "139"              }            }, {              "match_phrase": {                "server.port": "445"              }            }],            "minimum_should_match": 1          }        }      }, {        "meta": {          "field": "client.as.organization.name",          "negate": true,          "index": "elastiflow-flow-ecs-*",          "alias": null,          "disabled": false,          "params": {            "query": "PRIVATE"          },          "type": "phrase",          "key": "client.as.organization.name"        },        "query": {          "match_phrase": {            "client.as.organization.name": "PRIVATE"          }        }      }, {        "$state": {          "store": "appState"        },        "meta": {          "field": "server.as.organization.name",          "negate": false,          "alias": null,          "index": "elastiflow-flow-ecs-*",          "disabled": false,          "params": {            "query": "PRIVATE"          },          "type": "phrase",          "key": "server.as.organization.name"        },        "query": {          "match_phrase": {            "server.as.organization.name": "PRIVATE"          }        }      }],      "relation": "AND"    },    "query": {}  }],  "interval": "5m",  "from": "now-360s",  "to": "now",  "meta": {    "from": "1m"  },  "risk_score": 73,  "severity": "high",  "threat": [{    "framework": "MITRE ATT&CK",    "technique": [{      "reference": "https://attack.mitre.org/techniques/T1190",      "name": "Exploit Public-Facing Application",      "subtechnique": [],      "id": "T1190"    }],    "tactic": {      "reference": "https://attack.mitre.org/tactics/TA0001",      "name": "Initial Access",      "id": "TA0001"    }  }],  "references": ["https://attack.mitre.org/techniques/T1190/"]}
{  "author": ["ElastiFlow Inc."],  "license": "ElastiFlow EULA",  "immutable": false,  "max_signals": 100,  "throttle": "no_actions",  "enabled": false,  "rule_id": "ab39ef42-d604-41c3-95a7-6024db609b82",  "name": "NFS Access from Public IP",  "tags": ["elastiflow", "security", "access", "inbound"],  "description": "A connection attempt is made to the Network File System (NFS) shares from a public IP address. NFS is a network protocol commonly used for file sharing in Unix and Linux environments. Access to NFS shares from public IP addresses can indicate external attackers attempting to exploit NFS vulnerabilities or unauthorized users trying to gain illicit access to sensitive files and data.",  "note": "When this alert is triggered, immediate action should be taken by the IT or security team to investigate the source of the access attempt and assess whether it poses a security risk. Response actions may include blocking the offending IP address, reviewing NFS access controls, implementing stronger authentication mechanisms, and conducting a comprehensive security audit of the NFS environment to identify and remediate potential vulnerabilities.",  "type": "query",  "language": "kuery",  "index": ["elastiflow-flow-ecs-*"],  "query": "*",  "filters": [{    "$state": {      "store": "globalState"    },    "meta": {      "negate": false,      "index": "elastiflow-flow-ecs-*",      "alias": "Public NFS Access",      "disabled": false,      "type": "combined",      "params": [{        "meta": {          "field": "server.port",          "negate": false,          "index": "elastiflow-flow-ecs-*",          "alias": null,          "disabled": false,          "params": ["2049"],          "type": "phrases",          "value": ["2049"],          "key": "server.port"        },        "query": {          "bool": {            "should": [{              "match_phrase": {                "server.port": "2049"              }            }],            "minimum_should_match": 1          }        }      }, {        "meta": {          "field": "client.as.organization.name",          "negate": true,          "index": "elastiflow-flow-ecs-*",          "alias": null,          "disabled": false,          "params": {            "query": "PRIVATE"          },          "type": "phrase",          "key": "client.as.organization.name"        },        "query": {          "match_phrase": {            "client.as.organization.name": "PRIVATE"          }        }      }, {        "$state": {          "store": "appState"        },        "meta": {          "field": "server.as.organization.name",          "negate": false,          "alias": null,          "index": "elastiflow-flow-ecs-*",          "disabled": false,          "params": {            "query": "PRIVATE"          },          "type": "phrase",          "key": "server.as.organization.name"        },        "query": {          "match_phrase": {            "server.as.organization.name": "PRIVATE"          }        }      }],      "relation": "AND"    },    "query": {}  }],  "interval": "5m",  "from": "now-360s",  "to": "now",  "meta": {    "from": "1m"  },  "risk_score": 73,  "severity": "high",  "threat": [{    "framework": "MITRE ATT&CK",    "technique": [{      "reference": "https://attack.mitre.org/techniques/T1190",      "name": "Exploit Public-Facing Application",      "subtechnique": [],      "id": "T1190"    }],    "tactic": {      "reference": "https://attack.mitre.org/tactics/TA0001",      "name": "Initial Access",      "id": "TA0001"    }  }],  "references": ["https://attack.mitre.org/techniques/T1190/"]}
{  "author": ["ElastiFlow Inc."],  "license": "ElastiFlow EULA",  "immutable": false,  "max_signals": 100,  "throttle": "no_actions",  "enabled": false,  "rule_id": "3139e376-c475-4b74-9b45-008a211661c8",  "name": "SQL Database Access from Public IP",  "tags": ["elastiflow", "security", "access", "inbound"],  "description": "A connection attempt is made to a SQL Database from a public IP address. SQL databases are widely used to store and manage critical data, making them attractive targets for malicious actors seeking to access, manipulate, or exfiltrate sensitive information. Access to SQL databases from public IP addresses can indicate external attackers trying to exploit database vulnerabilities or unauthorized users attempting to gain illicit access to sensitive data.",  "note": "When this alert is activated, immediate action should be taken to investigate the source of the access attempt and assess whether it poses a security risk. Response actions may include blocking the offending IP address, reviewing database access controls, implementing stronger authentication measures, and conducting a thorough security audit of the database environment to identify and remediate potential vulnerabilities.",  "type": "query",  "language": "kuery",  "index": ["elastiflow-flow-ecs-*"],  "query": "*",  "filters": [{    "$state": {      "store": "globalState"    },    "meta": {      "negate": false,      "index": "elastiflow-flow-ecs-*",      "alias": "Public SQL Database Access",      "disabled": false,      "type": "combined",      "params": [{        "meta": {          "field": "server.port",          "negate": false,          "index": "elastiflow-flow-ecs-*",          "alias": null,          "disabled": false,          "params": ["1433", "1434", "1521", "1630", "3306", "5432", "7210"],          "type": "phrases",          "value": ["1433", "1434", "1521", "1630", "3306", "5432", "7210"],          "key": "server.port"        },        "query": {          "bool": {            "should": [{              "match_phrase": {                "server.port": "1433"              }            }, {              "match_phrase": {                "server.port": "1434"              }            }, {              "match_phrase": {                "server.port": "1521"              }            }, {              "match_phrase": {                "server.port": "1630"              }            }, {              "match_phrase": {                "server.port": "3306"              }            }, {              "match_phrase": {                "server.port": "5432"              }            }, {              "match_phrase": {                "server.port": "7210"              }            }],            "minimum_should_match": 1          }        }      }, {        "meta": {          "field": "client.as.organization.name",          "negate": true,          "index": "elastiflow-flow-ecs-*",          "alias": null,          "disabled": false,          "params": {            "query": "PRIVATE"          },          "type": "phrase",          "key": "client.as.organization.name"        },        "query": {          "match_phrase": {            "client.as.organization.name": "PRIVATE"          }        }      }, {        "$state": {          "store": "appState"        },        "meta": {          "field": "server.as.organization.name",          "negate": false,          "alias": null,          "index": "elastiflow-flow-ecs-*",          "disabled": false,          "params": {            "query": "PRIVATE"          },          "type": "phrase",          "key": "server.as.organization.name"        },        "query": {          "match_phrase": {            "server.as.organization.name": "PRIVATE"          }        }      }],      "relation": "AND"    },    "query": {}  }],  "interval": "5m",  "from": "now-360s",  "to": "now",  "meta": {    "from": "1m"  },  "risk_score": 73,  "severity": "high",  "threat": [{    "framework": "MITRE ATT&CK",    "technique": [{      "reference": "https://attack.mitre.org/techniques/T1190",      "name": "Exploit Public-Facing Application",      "subtechnique": [],      "id": "T1190"    }],    "tactic": {      "reference": "https://attack.mitre.org/tactics/TA0001",      "name": "Initial Access",      "id": "TA0001"    }  }],  "references": ["https://attack.mitre.org/techniques/T1190/"]}
{  "author": ["ElastiFlow Inc."],  "license": "ElastiFlow EULA",  "immutable": false,  "max_signals": 100,  "throttle": "no_actions",  "enabled": false,  "rule_id": "cac6bcf1-88f8-41e7-a43b-05a4be1d666a",  "name": "NoSQL Datastore Access from Public IP",  "tags": ["elastiflow", "security", "access", "inbound"],  "description": "A connection attempt is made to a NoSQL Datastore from a public IP address. NoSQL datastores are widely used to store and manage critical data, making them attractive targets for malicious actors seeking to access, manipulate, or exfiltrate sensitive information. Access to NoSQL datastores from public IP addresses can indicate external attackers trying to exploit datastore vulnerabilities or unauthorized users attempting to gain illicit access to sensitive data.",  "note": "When this alert is activated, immediate action should be taken to investigate the source of the access attempt and assess whether it poses a security risk. Response actions may include blocking the offending IP address, reviewing database access controls, implementing stronger authentication measures, and conducting a thorough security audit of the database environment to identify and remediate potential vulnerabilities.",  "type": "query",  "language": "kuery",  "index": ["elastiflow-flow-ecs-*"],  "query": "*",  "filters": [{    "$state": {      "store": "globalState"    },    "meta": {      "negate": false,      "index": "elastiflow-flow-ecs-*",      "alias": "Public NoSQL Datastore Access",      "disabled": false,      "type": "combined",      "params": [{        "meta": {          "field": "server.port",          "negate": false,          "index": "elastiflow-flow-ecs-*",          "alias": null,          "disabled": false,          "params": ["5984", "6379", "7000", "7001", "7473", "7474", "7574", "8098", "8529", "8983", "9042", "9200", "9300", "11211", "27017", "27018", "27019", "28015", "28017", "29015"],          "type": "phrases",          "value": ["5984", "6379", "7000", "7001", "7473", "7474", "7574", "8098", "8529", "8983", "9042", "9200", "9300", "11211", "27017", "27018", "27019", "28015", "28017", "29015"],          "key": "server.port"        },        "query": {          "bool": {            "should": [{              "match_phrase": {                "server.port": "5984"              }            }, {              "match_phrase": {                "server.port": "6379"              }            }, {              "match_phrase": {                "server.port": "7000"              }            }, {              "match_phrase": {                "server.port": "7001"              }            }, {              "match_phrase": {                "server.port": "7473"              }            }, {              "match_phrase": {                "server.port": "7474"              }            }, {              "match_phrase": {                "server.port": "7574"              }            }, {              "match_phrase": {                "server.port": "8098"              }            }, {              "match_phrase": {                "server.port": "8529"              }            }, {              "match_phrase": {                "server.port": "8983"              }            }, {              "match_phrase": {                "server.port": "9042"              }            }, {              "match_phrase": {                "server.port": "9200"              }            }, {              "match_phrase": {                "server.port": "9300"              }            }, {              "match_phrase": {                "server.port": "11211"              }            }, {              "match_phrase": {                "server.port": "27017"              }            }, {              "match_phrase": {                "server.port": "27018"              }            }, {              "match_phrase": {                "server.port": "27019"              }            }, {              "match_phrase": {                "server.port": "28015"              }            }, {              "match_phrase": {                "server.port": "28017"              }            }, {              "match_phrase": {                "server.port": "29015"              }            }],            "minimum_should_match": 1          }        }      }, {        "meta": {          "field": "client.as.organization.name",          "negate": true,          "index": "elastiflow-flow-ecs-*",          "alias": null,          "disabled": false,          "params": {            "query": "PRIVATE"          },          "type": "phrase",          "key": "client.as.organization.name"        },        "query": {          "match_phrase": {            "client.as.organization.name": "PRIVATE"          }        }      }, {        "$state": {          "store": "appState"        },        "meta": {          "field": "server.as.organization.name",          "negate": false,          "alias": null,          "index": "elastiflow-flow-ecs-*",          "disabled": false,          "params": {            "query": "PRIVATE"          },          "type": "phrase",          "key": "server.as.organization.name"        },        "query": {          "match_phrase": {            "server.as.organization.name": "PRIVATE"          }        }      }],      "relation": "AND"    },    "query": {}  }],  "interval": "5m",  "from": "now-360s",  "to": "now",  "meta": {    "from": "1m"  },  "risk_score": 73,  "severity": "high",  "threat": [{    "framework": "MITRE ATT&CK",    "technique": [{      "reference": "https://attack.mitre.org/techniques/T1190",      "name": "Exploit Public-Facing Application",      "subtechnique": [],      "id": "T1190"    }],    "tactic": {      "reference": "https://attack.mitre.org/tactics/TA0001",      "name": "Initial Access",      "id": "TA0001"    }  }],  "references": ["https://attack.mitre.org/techniques/T1190/"]}
{  "exported_count": 7,  "missing_rules": [],  "missing_rules_count": 0}